const data = {
    info : {
        design: {
            title: 'Дизайн интерьера',
            desc: [
                'Размещение технических люков на кухне и в санузлах, их габариты должны подбираться с учетом комфорта эксплуатации, свободы доступа и обслуживания.',
                'Сантехоборудование (душевую кабинку, унитаз, ванну) следует устанавливать максимально близко к канализационным стоякам.',
                'Стены, к которым примыкает мебель и сантехническое оборудование (запорная арматура, унитаз, биде, ограждение ванны, душевой кабинки), рекомендуют облицовывать гладким кафелем. Если в местах премыкания сантехнического оборудования применяют 3D плитку, клиент должен быть проинформирован о неудобствах, возможных при таком решении.',
                'Выбор светильников и их количества осуществляется с учетом КЕО согласно требованиям к освещенности жилых помещений.'
            ],
            imgURL: 'img/dizajn-intere`era.jpg'
        },
        unbuild: {
            title: 'Демонтаж',
            desc: 
            [
                'Демонтаж конструкций осуществляется согласно действующим нормам с соблюдением правил техники безопасности',
                'При проведении таких работ важно максимально сохранить целостность имущества клиента. Поэтому обязательной упаковке подлежат датчики пожарной сигнализации, окна, радиаторы, двери и т.п',
                'Производить демонтаж систем отопления, канализации, водопроводных труб и стяжек разрешено после отключения отопления и водоснабжения. При этом следует убедиться, что запорная арматура в данном помещении исправна.',
                'Разборка несущих конструкций или установка в них проемов возможна при наличии разрешительных документов и утвержденного проекта. Мероприятия согласовываются с руководителем работ.'
            ],
            imgURL: 'img/demontazh.jpg'
        },
        otdelka: {
            title: 'Отделка',
            desc: [
                'Грунтовка монолитного или кирпичного основания стен производится макловицей, оштукатуренного – валиком.',
                'Просечно-вытяжная сетка набивается следующим образом: отверстия под ее размер предварительно набуриваются, после чего их грунтуют, а сетку наполняют.',
                'Маяки для штукатурки устанавливаются строго по вертикали (горизонтали) относительно выступающих точек стены или потолка. По желанию клиента, периметр сохраняется. Дальнейшая расстановка промежуточных маяков производится по натянутому шнурку с учетом положения маяков, уже размещенных на краях (их выставляют на раствор). После застывания штукатурки маяки убирают.',
                'Слой штукатурки наносят на прогрунтованную поверхность с учетом установленных маяков (на стенах они выставлены вертикально, на потолке – горизонтально). Полипропиленовую сетку укладывают в штукатурку в местах, где примыкают кладочные перегородки и монолит.',
                'Армированную кирпичную кладку следует устанавливать, соблюдая перевязки. При этом на каждом третьем ряду используют закладные анкера, а на каждом четвертом – кладочную сетку. Там, где перегородка примыкает к железобетонным конструкциям, кладочную сетку крепят на ширину кладки и по высоте.',
                'Стыки листов гипсокартона грунтуются и шпатлюются соответствующими шпатлёвками. Для этого обязательно применяется бандажная лента. Появление впадин и бугров на поверхности не допускается.',
                'При установке гипсокартона применяют профиля CW и UW толщиной от 0,55 мм, набирая их с шагом 400 мм. Во внутреннем и наружном углу примыкания перегородок, где расположены дверные проемы, применяют усиленный профиль толщиной от 1,2 мм. Перегородки формируются из 2-ух листов гипсокартона, заполненных звукоизолирующим наполнителем и имеющих соответствующую перевязку. Если на фальшстену или перегородку крепятся навесные кухонные шкафы, применяют профиль CW и UW толщиной от 1,2 мм.',
                'Фальшстены, коробы и навесной потолок монтируются с шагом 400 мм. П-образный крепеж при этом не должен превышать 500 мм, а прикручивать его нужно к профилю на 2 шурупа LN через тело с обеих сторон. Фронтальную часть потолка, фальшстены или короба скрепляют заклепками или шурупами LN с плоской шляпкой. Для участков, где балконные (оконные) рамы и ГКЛ примыкают друг к другу, стоит выбирать влагостойкий гипс, а крепить его нужно на оцинкованные саморезы.',
                'При чистовой стяжке полов важно ориентироваться на расположение маяков, выравнивая при необходимости поверхность. После высыхания стяжки допустима неровность поверхности до 1,5 мм. В зависимости от размера стяжки и ее глубины, по периметру непременно производится деформационный шов, толщина которого составляет около 5-8 мм.',
                'Армирование поверхностей, предназначенных под покраску, выполняется с помощью стеклохолста. Его плотность не должна быть ниже 50-й. Он клеится на тщательно прогрунтованные стены или потолок, которые обильно смазывают специальным клеем с помощью макловицы или валика. Клеить и разглаживать стеклохолст на поверхности следует, используя шпатель, а клей наносить на лицевую сторону материала.',
                'Шпатлюя потолки и стены, особый акцент делают на таких участках: внутренние углы, откосы, места примыкания багетов, мебели, плинтусов и обналичников. Для таких работ используют готовые акриловые шпатлевки. Для получения равномерного цвета и одинакового оттенка рекомендуют применять смеси одной и той же торговой марки и серии.'
            ],
            imgURL: 'img/otdelka.jpg'
        },
        electro: {
            title: 'Электромонтаж',
            desc: [
                'Электромонтажные работы выполняются в соответствии с проектом, который был утвержден заказчиком. Укладывают провода согласно нормам ПУЭ, ДБН и СНиП. Их располагают перпендикулярно или параллельно поверхности стен и прочно закрепляют',
                'Соединение распределительных коробок выполняется посредством плотно скрученных проводов. Их длина должна быть не менее 50 мм. В дальнейшем их обжимают гильзой нужного диаметра или сваривают специальным электродом. Для изоляции проводов применяют термоусадку и ПВХ-изоленту.',
                'Электрощит коммутируют согласно требованиям ПУЭ. Для этого рекомендуют использовать кабеля и провода одной торговой марки, чтобы избежать различий в цветах. До установки навесных потолков (фальшстен) и заделывания штроб все провода укладывают, электрощит и распределительные коробки коммутируются и тестируются, а проделанные работы принимаются руководителем проекта.'

            ],
            imgURL: 'img/yelektromontazh.jpg'
        },
        doors:{
            title: 'Установка дверей',
            desc: [
                'Начинают такие монтажные работы с изучения геометрии проемов, затем уточняют направление открывания дверей (если нет согласованных планов) и осматривают комплектующие на наличие дефектов.',
                'Руководитель информируется обо всех найденных дефектах.',
                'После окончания отделочных работ производится монтаж дверных блоков на готовое напольное покрытие с применением клей-пены. Выравнивание порожков и плинтусов делается после установки наличников.',
                'При монтировании дверных блоков не должна быть повреждена готовая отделка. Между напольным покрытием и торцом дверного полотна допустим зазор размером не более 10 мм. При этом предварительно следует выполнить выравнивание пола. По периметру дверного полотна в закрытом состоянии зазоры должны быть одинаковыми.',
                'Как только руководитель примет проект, работы считают оконченными.'

            ],
            imgURL: 'img/ustanovka-dverej.jpg'
        },
        window:{
            title: 'Установка окон',
            desc: [
                'Монтаж балконных и оконных блоков производится смежными специальными организациями. Горизонтальная плоскость для установки окон во всем помещении одинаковая. Для этого бригадир сообщает смежникам о пометке уровня чистого пола.',
                'После завершения установки таких конструкций следует проверить: <br> 1) прочность их фиксации в проемах, принимая во внимание правильный выбор применяемых метизов и крепежных узлов; <br> 2) воздухонепроницаемость заполнения пеной щелей по всей длине рам; <br> 3) устойчивость крепления отливов и козырьков; <br> 4) легкость открытия и закрытия окон в любых режимах; <br> 5) отсутствие царапин и других дефектов на фрамугах, дверях, стеклопакетах, створках, рамах и т.д.; <br>6) отсутствие пены с внешней стороны конструкции; <br>7) удаление пленки работниками на внутренней части конструкции по окончанию отделочных мероприятий. <br>8) Законченными работы считают после того, как их примет руководитель.'
            ],
            imgURL: 'img/ustanovka-okon``.jpg'
        },
        paint:{
            title: 'Малярные работы',
            desc: [
                'Поклейка обоев осуществляется только после завершения черновых работ и подготовительных мероприятий. Подоконники и окна должны быть чистыми, потолки и откосы покрашены, а поверхность полов, стен и потолков прогрунтована. Перед оклеиванием следует пересчитать требуемое количество рулонов, учитывая отходы и раскрой. Также нужно проверить, есть ли заводской брак на обоях и все ли они имеют одинаковую маркировку. Рулонов достаточно, на них нет дефектов или брака? Тогда можно открыть первый из них и выполнить его раскрой и поклейку трех полос. При этом необходимо учитывать рекомендации производителя обоев, указанные на упаковке, и использовать требуемый клей. Как только клиент одобрит готовый вариант поклейки первого рулона, работы можно продолжать.',
                'Покраску следует производить по завершению подготовительных и черновых мероприятий, когда поверхности полов, стен и потолков будут прогрунтованы. Потолочные багеты должны быть закреплены, а в гипсокартоне следует сделать отверстия под светильники. Когда поверхности будут осмотрены и приняты руководителем, можно выполнять их дальнейшую покраску. Предметы, на которые может попасть краска (радиаторы, оконные блоки, подоконники и т.п.), должны быть накрыты пленкой и оклеены малярным скотчем. Применяя компрессор, методику покраски нужно согласовать с руководителем. При попадании краски на поверхности, пятна следует сразу же удалить.'
            ],
            imgURL: 'img/malyarnie-raboti.jpg'
        },
        blocks:{
            title: 'Плиточные работы',
            desc: [
                'Перед выполнением укладки следует пересчитать требуемое количество кафеля для пола и стен, фриза, декоративных и других элементов (с учетом отходов). При этом ориентируются на карты разверток и укладки. Затем проверяют, соответствует ли выбранный клей размерам плитки, материалу и методике ее укладки.',
                'Если разработан дизайн-проект, кафель нужно укладывать не отклоняясь от карты укладки. Поверхность для таких работ должна быть чистой и прогрунтованой, а плитку укладывают под гребенку (соответствующего номера). Перед этим стены, пол и поверхность кафеля нужно прошпатлевать клеем. При отсутствии карт и разверток, размещение плитки и участков подрезов необходимо согласовать с руководителем и клиентом. Во время укладки клейная масса не должна иметь полости и лакуны. В пределах 1 захватки швы и поверхность нужно промыть начисто. Наличие остатков клея на швах и кафеле недопустимо.'
            ],
            imgURL: 'img/plitochny`e-raboty`.jpg'
        },
        plumbing:{
            title: 'Сантехнические работы',
            desc: [
                'Для установки ГВС, ВК и ОС нужно иметь утвержденный клиентом проект и техническую документацию на сантехническое оборудование. При этом требуется тот же материал, который применял застройщик.',
                'На закрытых участках трубы водоснабжения и отопления в обязательном порядке изолируются. После установки всех узлов перед заделкой штроб системы опрессовывают.',
                'Муровать резьбовые стыки и переходы с металла на пластик недопустимо. Они должны быть легкодоступными для обслуживания.',
                'Подключение выпусков унитаза, душевой кабины и ванны к хозяйственно-бытовой канализации, монтаж бойлера к ГВС и ХВ производится «жестким» подсоединением. Исключение составляют те случаи, когда оно технически усложнено или невозможно.'
            ],
            imgURL: 'img/santehnicheskie-raboty`.jpg'
        },
        air:{
            title: 'Кондиционирование',
            desc: [
                'Установка систем кондиционирования производится смежными специальными организациями. Места для монтажа внутренних блоков выбираются согласно проекту или утверждаются заказчиком в соответствии с техническими нормами.',
                'Установка внутренних блоков выполняется согласно ТУ и требованиям их дальнейшей эксплуатации. Бригадир обязан предоставить смежникам отметку опуска поверхности пола для каждого помещения.',
                'Работы включают 2 основных этапа:',
                'установка наружных блоков и магистральных труб (во время черновой отделки до монтажа фальшстен и навесных потолков);',
                'установка внутренних блоков (после заключительной отделки).',
                'Контроль монтажных работ выполняется руководителем и бригадиром на всех этапах. Следует обеспечить термоизоляцию и герметичность систем трубопровода. Повороты магистралей делаются плавными. В участках прохождения магистралей через элементы конструкций отверстия должны быть воздухонепроницаемыми – оштукатуренными и запененными.',
                'Если в помещении отсутствует возможность сброса конденсата наружу и нет ливневых стояков, конденсат выводится в хозяйственно-бытовую канализацию с помощью специальных сифонов. При этом доступ к дренажным насосам (при их наличии) и сифонам должен быть свободным. По окончанию монтажа наружных блоков по периметру крышки оставляются одинаковые зазоры.',
                'Правильность функционирования системы тестируется до того, как появится конденсат (если он выведен на улицу). В других случаях – до получаса. При установке внутренних блоков недопустимы повреждения готовой отделки.',
                'По завершению каждого этапа работы принимаются руководителем.'
            ],
            imgURL: 'img/kondetsionirovanie.jpg'
        },
        camera:{
            title: 'Слоботочные системы',
            desc: [
                'Системы видеонаблюдения, спутниковое и кабельное ТВ, интернет, телефон, охранная и пожарная сигнализации относят к слаботочным сетям. Их прокладка выполняется специальными смежными организациями.',
                'Монтаж и наладка оборудования производятся учреждениями, специализирующимися на этом виде услуг. Перед установкой слаботочных систем заказчик должен указать перечень требуемых сетей и выбрать фирму, которая будет заниматься обслуживанием.',
                'Эти компании предоставляют ТУ и разрабатывают проект сети, указывают расположение слаботочных реле, щита, розеток и других узлов.',
                'Установка слаботочных сетей выполняется в одно время с монтажом электросетей. Во избежание влияния помех, расстояние между слаботочными проводами и силовыми кабелями при прокладке должно быть от 50 см. Пересекаться они должны под прямым углом. Когда телефонные провода ведутся в одном направлении, их нужно прокладывать параллельно, плотно прижимая друг к другу. Слаботочные кабеля запрещено заводить в стояк, в который помещены электропровода.',
                'По завершению установки сетей кабеля проверяют, а работа принимается руководителем.'
            ],
            imgURL: 'img/slabotochny`e-sistemy`.jpg'
        },
        trash:{
            title: 'Уборка и вывоз мусора',
            desc: [
                'По окончании рабочего дня в помещениях выполняется текущая уборка.',
                'Мусор собирается в помещении до объемов заполнения транспорта, применяемого для его вывоза. При этом учитывается площадь помещения и методика проведения работ. Участок для временного хранения мусора и срок его погрузки необходимо согласовать с управляющей ЖК организацией или клиентом.',
                'Убрать мусор из помещения нужно за два часа до приезда транспортного средства.',
                'После завершения работ производится уборка помещения и участка, по которому выносили мусор.'

            ],
            imgURL: 'img/uborka-i-vy`voz-my`sora.jpg'
        },
        priceWork:{
            title: 'Как формируется стоимость работ?',
            desc:[
                'После составления сметы нам позвонил заказчик и сказал, что другая фирма рассчитала цену, которая в 2 раза ниже предложенной нами. Оказалось, что эта компания сделала смету для услуги косметического ремонта. При ее анализе определили, что в ней не указан целый ряд важных работ. Подрядчик рассчитывал, что после начала проекта все новые работы клиент оплатит как дополнительные. Поэтому цена в смете будет постоянно повышаться.',
                'Правильное и грамотное составление сметы с учетом пожеланий заказчика и всех технических моментов – гарантия того, что дополнительные расходы не превысят 7% общей стоимости ремонта.',
                'На ряде работ можно сэкономить: так, при покраске стен стеклохолст заменяют бюджетным вариантом – флизелином без текстуры,  пропуская этап финишной шпатлевки. Однако на монтаже электропроводки и сантехнических работах экономить не рекомендуют: минимальный срок эксплуатации кабелей и труб, заложенных в стены и полы, должен составить 35 лет.',
                'В нашей компании смету формирует технолог, компетентный в области отделки, мебели, установки систем кондиционирования, сантехники, электромонтажа и т.д. Таким образом мы оглашаем клиенту реальную стоимость услуг.'
            ],
            imgURL: 'img/uborka-i-vy`voz-my`sora.jpg'
        }
    },
    form: {
        price:  {
            title: 'Получите актуальный прайс',
            desc: 'desc form',
            btnTitle: 'Получить',
            comment: 'Прайс будет отправлен на вашу почту'
        },
        repairs:{
            title: 'Давайте рассчитаем точную стоимость ремонта',
            btnTitle: 'Рассчитать смету',
            comment: 'Мы перезвоним в течении двух часов'
        },
        key: {
            title: 'Оставьте заявку на качественный ремонт',
            btnTitle: 'Жду звонка',
            comment: 'Мы перезвоним в течении двух часов'
        }
    },
    file: {
        title: 'Давайте проверим смету на честность',
        btnTitle: 'Отправить'
    }
}

const body = document.querySelector('body');

function showModal(modal) {
    let timer;

    document.addEventListener('click',(e)=>{
        if(e.target.classList.contains('modal-wrapper') ||
        e.target.classList.contains('modal-form__close') ||
        e.target.classList.contains('modal-form__hamburber') ){
            const wrapper = document.querySelector('.modal-wrapper');

            wrapper.classList.remove('open');
            body.style.overflow = 'visible';
            
            setTimeout(()=>{
                wrapper.remove() 
                clearTimeout(timer)
            },500)       
        }
    })
    
    
   
    body.insertAdjacentHTML('beforeend',modal);
    
}
function checkType(){
    let servicesList = document.querySelectorAll('.services-list__item');

    servicesList.forEach(el=>{
        el.addEventListener('click',(e)=>{
            let type = el.dataset.modal;
            let infoType = el.dataset.info;

            e.preventDefault()
            showModal(drawModal(type,data,infoType))
            
            Inputmask({
                mask: '+38 (999) 999 99 99'
            }).mask(document.querySelector('.inp-tel'));
        })
    })

    document.addEventListener('click',(e)=>{
        let type = e.target.dataset.modal;
        let infoType = e.target.dataset.info;

        if(type) {
            e.preventDefault()
            showModal(drawModal(type,data,infoType));
            if(type != 'form-message') {
                Inputmask({
                    mask: '+38 (999) 999 99 99'
                }).mask(document.querySelector('.inp-tel'));
            }
            
        }

        
        
    })
}
function drawModal(type,data,infoData){
    let modal = '';
    let list = '';
    let input = '';
    if(type == 'info') {
        body.style.overflow = 'hidden';
        data[type][infoData].desc.forEach(el=>{
            list+=`<li class='modal-info__item'>${el}</li>`
        })
        if(infoData == 'priceWork') {
            input = `<input type="text" class='input-des modal-info__inp' placeholder='Введите имя'/>`
        }
        modal = `
        <div class="modal-wrapper open">
            <div class="modal-info">
                <div class='modal-form__close' >
                    <span class='modal-form__hamburber' ></span>
                </div>
                <h2 class="modal-info__title">${data[type][infoData].title}</h2>
                <img src="${data[type][infoData].imgURL}" class='modal-info__img'/>
                <ul class='modal-info__desc'>${list}</ul>  
                <div class='modal-info__faq'>
                    <h3 class='modal-info__subtitle'>
                        Остались вопросы? <br>
                        Оставьте номер и мы перезвоним
                    </h3>
                    <form class='modal-info__data'>
                        ${input}
                        <input type="tel" pattern="[0-9]{3}-[0-9]{3}-[0-9]{4}" class='input-des modal-info__inp inp-tel' placeholder='Введите телефон'> 
                        <input type="submit" value='Жду звонка' class='main-btn btn-anim modal-info__btn'/>
                    </form>
                </div>
                
            </div>
        </div>        
    `
    
    } else if(type == 'form') {
        body.style.overflow = 'hidden';
        modal = `
        <div class="modal-wrapper open">
            <div class="modal-form ">
                <img src='img/modal-1.jpg' class='modal-form__img' />
                <form class='modal-form__desc'>
                    <h3 class='modal-form__title'>${data[type][infoData].title}</h3>
                    <input type="tel" class='input-des modal-form__inp inp-tel' placeholder='Введите телефон'> 
                    <input type="email" class='input-des modal-form__inp' placeholder='Введите e-mail'/>
                    <input type="submit" value='${data[type][infoData].btnTitle}' class='main-btn btn-anim modal-form__btn'/>
                    <span class='modal-form__comment'>${data[type][infoData].comment}</span>    
                </form> 
                <div class='modal-form__close' >
                        <span class='modal-form__hamburber' ></span>
                </div>
            </div>
        </div>        
    `
    } else if(type == 'form-message') {
        body.style.overflow = 'hidden';
        modal = `
        <div class="modal-wrapper open">
            <div class="modal-message ">
                <img src='img/modal-1.jpg' class='modal-message__img' />
                <div class='modal-message__wrapper'>
                    <h3 class="modal-form__title">Расскажите о своей задаче</h3>
                    <form action="" class="modal-message__desc main-form">
                        <div class="main-form__data">
                            <input placeholder="Введите имя" type="text" class="input-des">
                            <input placeholder="Введите e-mail" type="email" name="" id="" class="input-des">
                        </div>
                        <div class="main-form__message">
                            <textarea placeholder="Введите сообщение" maxlength='200' cols="30" rows="10" class="input-des main-form__area"></textarea>
                            <input type="submit" value="Жду звонка" class="main-form__submit main-btn btn-anim">
                        </div>
                    </form>
                </div>
                <div class='modal-form__close' >
                        <span class='modal-form__hamburber' ></span>
                </div>
            </div>
        </div>        
    `

    } else if(type=='file'){
        body.style.overflow = 'hidden';
        modal = `
        <div class="modal-wrapper open">
            <div class="modal-form ">
                <img src='img/modal-1.jpg' class='modal-form__img' />
                <form class='modal-form__desc'>
                    <h3 class='modal-form__title'>${data[type].title}</h3>
                    <input type="text" class='input-des modal-form__inp' placeholder='Введите имя'/>
                    <input type="tel" class='input-des modal-form__inp inp-tel' placeholder='Введите телефон'> 
                    <input type="file" class='input-des modal-form__inp' />
                    <input type="submit" value='${data[type].btnTitle}' class='main-btn btn-anim modal-form__btn'/>
                </form> 
                <div class='modal-form__close' >
                        <span class='modal-form__hamburber' ></span>
                </div>
            </div>
        </div>        
    `
    }
    
    return modal
}


checkType()
